/*
    Създайте приложение, което да поддържа информация за маршрутни таксита.
    Данните за колите са марка, модел, години, колко местна е, с каква товароподемност и
    колко разход на гориво иска. Тези коли покриват някакви маршрути в града.
    За маршрута трябва да се знае възловите му точки  и колко километра е дълъг и колко пъти
    на ден се обикаля.

    Приложението да има възможност за въвеждане на произволен брой различни маршрутни таксита и маршрути(10 точки).
    Да има възможност за избор на маршрутни таксита на което да се задава маршрут и да извежда информация колко гориво да се зареди за извършване не дневната обиколка (10 точки).
    Класовете (най-малко 3 класа при реализацията) трябва да капсулира всичките детайли. Използват се private инстанции на променливите за съхраняване на различните детайли. Трябва да има най-малко два конструктора, public getters/setters за private инстанции на променливите (30 точки).
    Необходимо е да извършвате проверка на входните данни (10 точки).
    Да се предефинира операцията <<, която да се използва за извеждане на данните (10 точки). Данните да се четат и съхраняват във файл (20 точки).
    Класовете да се опишат с UML клас диаграма (10 точки).
    Задължително данните да се въвеждат динамично, чрез меню.
*/

/// TODO:
/// Change new Menu -> with just menu
/// Check on destructos and destructing items in vectors

#include <iostream>
#include <conio.h>
#include "MenuItem.h"
#include "MenuItems.cpp"

void menu(TaxiState state) {
    std::vector<MenuItem *> items;
    items.push_back(new CreateCar(true));
    items.push_back(new CreateRoute(2));
    items.push_back(new ListTaxis(3));
    items.push_back(new SaveToFile(4));
    items.push_back(new LoadFromFile(5));
    items.push_back(new ExitMenuItem(6));

    Menu menu = Menu(items, state);
    menu.show();
}

int main()
{
    TaxiState state;
    menu(state);
    return 0;
}
